contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
    cJSON_Delete(tools);                           // cJSON_Delete(NULL) is safe
    if (s_aborting)  { s_responding = false; return; }  // barge-in: the new turn owns the UI — touch nothing
    if (s_run_error) { s_responding = false; return; }  // error → keep "Error" up, don't speak
    if (s_tts_len > 0) {                           // P-a: speak the whole buffered reply (batch TTS).
        chat_ui_status("Speaking...");             // WSS opens now — the SSE is already closed (sequential TLS)
        tts_speak_reply(s_tts_text);
        if (s_aborting) { s_responding = false; return; }  // barged in DURING playback → don't repaint idle
    }
    chat_ui_status(IDLE_HINT);                     // back to the idle prompt
    s_responding = false;
}

// ---- PTT "go ahead and talk" beep -------------------------------------------------------------
// A short, subtle sine cue played on the ES8311 speaker the instant a hold starts. It plays from
// ptt_task BEFORE soniox_session_start() creates capture_task, so it never glitches an in-flight
// mic read. The speaker is a second esp_codec_dev OUT handle that coexists with the always-open mic
// IN handle on the single ES8311; both MUST use the same 16k/16/1 format (the shared codec/I2S
// clock's last set_fs wins — and it is NOT auto-enforced, so BEEP_SR is hard-pinned). Opening the
// speaker soft-resets the shared chip (clobbers the mic ADC gain) and its acoustic crosstalk lands
// in the live RX DMA ring — capture_task compensates by re-asserting the mic gain and draining the
// ring before it forwards any audio (see soniox_client capture_task).
#define BEEP_SR        16000   // MUST equal soniox_client DEFAULT_SR (the mic rate)
#define BEEP_MS        90      // duration of one beep
#define BEEP_FADE_MS   6       // linear fade in AND out — kills edge clicks
#define BEEP_VOL       75      // esp_codec_dev out-vol INDEX 0-100 (NOT dB; 0 would be -96 dB = silent).
                               // Shared by both tones at a known-good analog gain; loudness is set by the
                               // digital amplitude below, so neither tone overdrives the PA.
// Two tones share the speaker: a SUBTLE PTT "go ahead" cue and a LOUDER, higher-pitched timer alarm.
// Loudness ≈ amplitude / 32767 of full scale (clean headroom — alarm can go toward ~30000 for more).
#define CUE_FREQ       950     // Hz — subtle mid tone for the PTT cue
#define CUE_AMPL       6000    // ~0.18 FS — subtle (unchanged)
#define ALARM_FREQ     1760    // Hz — higher pitched, more attention-getting (loudness ramps in
                               // run_timer_alarm via ALARM_LEVELS, so there's no fixed alarm amplitude)
#define BEEP_SAMPLES   (BEEP_SR * BEEP_MS / 1000)        // 1440
#define BEEP_FADE_N    (BEEP_SR * BEEP_FADE_MS / 1000)   // 96

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

static esp_codec_dev_handle_t s_spk;              // speaker OUT handle, opened once and kept open
static int16_t s_cue_pcm[BEEP_SAMPLES];           // PTT cue (subtle)
static int16_t s_alarm_pcm[BEEP_SAMPLES];         // timer alarm (loud, higher)
static bool    s_beep_ready;

// Fill `buf` with a `freq` sine at 16k mono, linear fade-in/out on the edges so the buffer's
// start/end discontinuities don't click. Peak ±ampl; keep ampl < 32767 so it can't digitally clip.
static void fill_tone(int16_t *buf, int freq, int ampl)
{
    const double w = 2.0 * M_PI * (double)freq / (double)BEEP_SR;
    for (int i = 0; i < BEEP_SAMPLES; i++) {
        double env = 1.0;                                            // anti-click amplitude envelope
        if (i < BEEP_FADE_N)                       env = (double)i / BEEP_FADE_N;
        else if (i >= BEEP_SAMPLES - BEEP_FADE_N)  env = (double)(BEEP_SAMPLES - 1 - i) / BEEP_FADE_N;
        buf[i] = (int16_t)lrint(sin(w * i) * env * ampl);
    }
}

// Lazily bring up the speaker (once). Returns true if s_spk is open at 16k/16/mono. The speaker is a
// second esp_codec_dev OUT handle that coexists with the always-open mic on the single ES8311 — both
// MUST use the same 16k rate. lp_idle closes it; the next beep/TTS write reopens it here.
static bool spk_ensure(void)
{
    if (s_spk) return true;
    s_spk = bsp_audio_codec_speaker_init();                 // pa_pin = GPIO46, raised automatically
    if (!s_spk) { ESP_LOGW(TAG, "speaker init failed"); return false; }
    esp_codec_dev_set_out_vol(s_spk, BEEP_VOL);             // 0-100 index, NOT dB
    esp_codec_dev_sample_info_t fs = { .bits_per_sample = 16, .channel = 1, .sample_rate = BEEP_SR };
    if (esp_codec_dev_open(s_spk, &fs) != ESP_OK) {         // same 16k as the mic → full-duplex OK
        ESP_LOGW(TAG, "speaker open failed");
        s_spk = NULL;                                       // retry on the next call
        return false;
    }
    ESP_LOGI(TAG, "speaker ready (16k mono)");
    return true;
}

// Lazily bring up the speaker (once) and play one precomputed tone. Blocks (~90 ms) until it is
// clocked out of the I2S TX DMA. Call ONLY from a task (ptt_task / timer task), never a button cb.
static void play_beep(const int16_t *pcm)
{
    if (!s_beep_ready) {                            // build the cue once; run_timer_alarm (re)fills the
        fill_tone(s_cue_pcm, CUE_FREQ, CUE_AMPL);   // alarm buffer at its current escalation level
        s_beep_ready = true;
    }
    if (!spk_ensure()) return;
    esp_codec_dev_write(s_spk, (int16_t *)pcm, BEEP_SAMPLES * sizeof(int16_t));   // API wants non-const
}

static void play_ptt_beep(void) { play_beep(s_cue_pcm); }   // PTT "go ahead" cue (existing call sites)

// TTS PCM sink: the soniox_tts_client drain task hands decoded pcm_s16le (16k/mono) here. main owns
// the single speaker handle, so TTS shares it with the beep + the low-power codec-close (no 2nd handle).
static void tts_pcm_write(const void *pcm, size_t bytes)
{
    if (!spk_ensure()) return;
    esp_codec_dev_write(s_spk, (void *)pcm, bytes);
}

#define TTS_VOL 90      // spoken replies louder than the subtle PTT beep (BEEP_VOL); 0-100 index, NOT dB
// Speak a full reply at TTS volume, restoring the beep volume afterward so the next PTT cue / alarm
// (which share s_spk) keep their tuned loudness.
static void tts_speak_reply(const char *text)
{
    if (spk_ensure()) esp_codec_dev_set_out_vol(s_spk, TTS_VOL);
    soniox_tts_speak(text);
    if (s_spk) esp_codec_dev_set_out_vol(s_spk, BEEP_VOL);
}

// --- Idle low-power: when the display is off AND on battery, shed WiFi + the codec/I2S and let the
// CPU light-sleep --------------------------------------------------------------------------------
// Driven by the chat_ui display-state hook. On battery-idle we (a) stop WiFi (radio off), (b) stop the
// mic + speaker codec so the I2S releases its NO_LIGHT_SLEEP lock (a running I2S blocks light sleep),
// and (c) release our own NO_LIGHT_SLEEP lock — so the CPU light-sleeps ONLY when WiFi+codec are both
// off, which is exactly battery-idle (never with WiFi associated → no heap churn → STT stays safe).
// On wake we reverse it. Plugged-in stays fully on. The set_timer still fires + rings (esp_timer wakes
// the CPU; the alarm reopens the speaker lazily via play_beep, no WiFi). A PTT press wakes everything
// then waits for the link. lp_idle/lp_wake are serialized by a mutex (called from screen + ptt tasks).
static volatile bool        s_lp_suspended;
static SemaphoreHandle_t    s_lp_mutex;
static esp_pm_lock_handle_t s_lp_lock;     // NO_LIGHT_SLEEP — HELD while active, released only when idle

