contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
static void lp_wake(void)   // bring WiFi + codec back if shed; exactly-once
{
    if (!s_lp_mutex) return;
    xSemaphoreTake(s_lp_mutex, portMAX_DELAY);
    if (s_lp_suspended) {
        s_lp_suspended = false;
        if (s_lp_lock) esp_pm_lock_acquire(s_lp_lock);   // no light sleep while active
        soniox_client_mic_start();                       // re-enable the mic I2S (+ gain) for the turn
        net_wifi_resume();
    }
    xSemaphoreGive(s_lp_mutex);
}

static void lp_idle(void)   // shed everything when idle — only on battery (plugged-in stays connected)
{
    if (!s_lp_mutex || s_lp_suspended || !device_tools_on_battery()) return;   // I2C read outside the mutex
    xSemaphoreTake(s_lp_mutex, portMAX_DELAY);
    if (!s_lp_suspended) {
        s_lp_suspended = true;
        soniox_client_mic_stop();                                // disable the mic I2S (RX)
        if (s_spk) { esp_codec_dev_close(s_spk); s_spk = NULL; } // disable the speaker I2S (TX); reopens on next beep
        net_wifi_suspend();
        if (s_lp_lock) esp_pm_lock_release(s_lp_lock);           // WiFi+I2S now off → allow light sleep
    }
    xSemaphoreGive(s_lp_mutex);
}

static void lp_set(bool display_on)   // chat_ui display-state hook (runs on the screen-power task)
{
    if (display_on) lp_wake();
    else            lp_idle();
}

// Configure PM for automatic light sleep + DFS, and take the NO_LIGHT_SLEEP lock (active at boot).
// lp_idle releases it once WiFi+codec are off; lp_wake re-takes it. If PM isn't compiled in, the WiFi/
// codec shedding still works (the lock is just NULL) — no light sleep, but no crash.
static void power_mgmt_start(void)
{
    s_lp_mutex = xSemaphoreCreateMutex();
    esp_pm_config_t pmc = { .max_freq_mhz = 240, .min_freq_mhz = 80, .light_sleep_enable = true };
    if (esp_pm_configure(&pmc) != ESP_OK) { ESP_LOGW(TAG, "PM configure failed (CONFIG_PM_ENABLE?)"); return; }
    if (esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "active", &s_lp_lock) != ESP_OK) return;
    esp_pm_lock_acquire(s_lp_lock);   // active at boot → no light sleep until lp_idle releases it
    ESP_LOGI(TAG, "PM: light sleep when idle (WiFi + codec off, on battery)");
}

// PTT state machine: press → open STT + stream; release → stop, assemble the utterance, run it.
static void ptt_task(void *arg)
{
    for (;;) {
        int ev;
        if (xQueueReceive(s_ptt_q, &ev, portMAX_DELAY) != pdTRUE) continue;

        if (ev == 1 && !s_listening) {                 // PRESS (incl. a barge-in restart)
            s_aborting   = false;                      // P-c: consume the barge-in flags for the new turn
            s_responding = false;                      // (the aborted turn is fully torn down by now)
            s_ptt_final[0] = '\0';
            s_ptt_run[0]   = '\0';
            s_listening = true;
            lp_wake();                                 // woke from WiFi-off idle? bring the radio back…
            if (!net_is_connected()) {                 // …and wait for the link before streaming to Soniox
                chat_ui_status("Connecting...");
                for (int i = 0; i < 100 && !net_is_connected(); i++) vTaskDelay(pdMS_TO_TICKS(50)); // ~5s
            }
            if (!net_is_connected()) {                 // gave up → don't open a doomed session
                s_listening = false;
                chat_ui_status("No WiFi");
                ESP_LOGW(TAG, "wake: WiFi did not reconnect");
                continue;
            }
            net_low_latency(true);                     // low-latency WiFi for the whole turn (mic + reply)
            chat_ui_status("Listening...");
            play_ptt_beep();                           // "go ahead" cue; plays & returns before capture starts
            soniox_cfg_t scfg = { 0 };                 // api_key from NVS
            if (soniox_session_start(&scfg, on_partial, on_turn, NULL) != ESP_OK) {
                s_listening = false;
                net_low_latency(false);                // no turn will run; restore power-save now
                chat_ui_status("STT error");
                ESP_LOGE(TAG, "STT failed to start");
            }
        } else if (ev == 0 && s_listening) {           // RELEASE
            s_listening = false;
            soniox_session_stop();                     // ws task is gone after this; buffers are stable
            char turn[1024];
            snprintf(turn, sizeof turn, "%s%s", s_ptt_final, s_ptt_run);
            char *t = turn;                            // trim surrounding whitespace
            while (*t == ' ' || *t == '\t') t++;
            size_t n = strlen(t);
            while (n && (t[n-1] == ' ' || t[n-1] == '\t' || t[n-1] == '\n')) t[--n] = '\0';
            if (*t) run_agent_turn(t);             // owns its terminal status (idle hint / "Error")
            else    chat_ui_status(IDLE_HINT);
            net_low_latency(false);                // turn done (reply streamed) → back to power-save

        } else if (ev == 2 && !s_listening) {      // DOUBLE-TAP → reopen setup portal (change endpoint etc.)
            chat_ui_status("Setup: join 'AMOLED-setup'");
            ESP_LOGI(TAG, "reconfigure: opening portal (only entered fields are saved)");
            net_portal_start("AMOLED-setup");
            bool saved = net_portal_wait_saved(180000);   // up to 3 min, then auto-close
            net_portal_stop();
            ESP_LOGI(TAG, "reconfigure: %s", saved ? "saved" : "timed out");
            if (saved) apply_timezone();   // P5: TZ may have changed in the portal
            chat_ui_status(IDLE_HINT);
        }
    }
}

// Any BOOT-button interaction wakes the display (note_activity un-arms a PWR-forced-off screen too),
// so reaching for the button to talk lights the screen even if it had blanked.
static void ptt_down_cb(void *btn, void *ctx)
{
    chat_ui_note_activity();
    if (s_responding) {                  // P-c BARGE-IN: a press while a reply is in flight aborts it
        ESP_LOGI(TAG, "barge-in: aborting active reply");
        s_aborting = true;               // set BEFORE agui_abort so h_error (fires inline) suppresses "Error"
        agui_abort();                    // cancel the AG-UI run (no-op if already past it)
        soniox_tts_cancel();             // stop TTS playback (no-op if not speaking)
    }
    int e = 1; xQueueSend(s_ptt_q, &e, 0);   // enqueue the press; ptt_task starts a fresh turn once unblocked
}
static void ptt_up_cb(void *btn, void *ctx)   { chat_ui_note_activity(); int e = 0; xQueueSend(s_ptt_q, &e, 0); }  // release
static void ptt_dbl_cb(void *btn, void *ctx)  { chat_ui_note_activity(); int e = 2; xQueueSend(s_ptt_q, &e, 0); }  // double-tap → setup

static esp_err_t ptt_button_init(void)
{
    // Hold (>= long_press_time) = talk; a quick tap or double-tap does NOT start a turn, so a
    // double-tap can open the setup portal without colliding with hold-to-talk.
    button_config_t bcfg = { .long_press_time = 300 };
    button_gpio_config_t gcfg = { .gpio_num = PTT_GPIO, .active_level = 0 };   // BOOT pulls GPIO0 low
    button_handle_t btn;
    esp_err_t err = iot_button_new_gpio_device(&bcfg, &gcfg, &btn);
    if (err != ESP_OK) return err;
    iot_button_register_cb(btn, BUTTON_LONG_PRESS_START, NULL, ptt_down_cb, NULL);  // hold → start
    iot_button_register_cb(btn, BUTTON_PRESS_UP,         NULL, ptt_up_cb,   NULL);  // release → stop + run
    iot_button_register_cb(btn, BUTTON_DOUBLE_CLICK,     NULL, ptt_dbl_cb,  NULL);  // double-tap → setup portal
    return ESP_OK;
}

// A firing timer RINGS until the screen is tapped: bursts of 4 quick beeps with a big red ring
// flashing on/off in sync, then a dark pause, repeating — and getting LOUDER every few cycles. Runs
// on the timer task. chat_ui_alarm_set() shows the red-ring overlay + suspends the idle power-saver;
// we poll chat_ui_touch_idle_ms() for the dismiss tap (object-independent, so a tap anywhere counts).
// Auto-stops after ALARM_MAX_MS, or if BOOT is held to start a turn (s_listening).
#define ALARM_BRIGHT     90
#define ALARM_BEEPS      4
#define ALARM_GAP_MS     150
#define ALARM_PAUSE_MS   900
#define ALARM_MAX_MS     120000
#define ALARM_CYCLES_PER_LEVEL 4   // beep cycles at each loudness before stepping up
// Escalating loudness — int16 amplitudes (~/32767 of full scale). Start ~half the comfortable level
// and step up every ALARM_CYCLES_PER_LEVEL cycles until dismissed; top stays clear of clipping.
static const int ALARM_LEVELS[] = { 6500, 10000, 15000, 21000, 28000 };  // ~0.20,0.30,0.46,0.64,0.85 FS
#define ALARM_NLEVELS ((int)(sizeof ALARM_LEVELS / sizeof ALARM_LEVELS[0]))

// True once a fresh dismiss tap is seen — but only after the screen has first gone quiet, so a tap
// just before the timer fired doesn't instantly dismiss it. `*armed` persists across calls.
static bool alarm_dismiss_tap(bool *armed)
{
    uint32_t ti = chat_ui_touch_idle_ms();
    if (ti > 600) *armed = true;            // quiet (finger up / no recent touch) → ready to accept a tap
    return *armed && ti < 250;              // a touch within the last 250ms
}

static void run_timer_alarm(const char *label)
{
    chat_ui_note_activity();
    chat_ui_alarm_set(true);                 // black overlay + red ring; suspends the idle saver

    int64_t start = esp_timer_get_time();
    bool armed = false, done = false;
    int  cycle = 0, level = -1;
    while (!done && !s_listening && (esp_timer_get_time() - start) < (int64_t)ALARM_MAX_MS * 1000) {
        int want = cycle / ALARM_CYCLES_PER_LEVEL;            // escalate loudness over cycles
        if (want >= ALARM_NLEVELS) want = ALARM_NLEVELS - 1;
        if (want != level) { level = want; fill_tone(s_alarm_pcm, ALARM_FREQ, ALARM_LEVELS[level]); }

        for (int i = 0; i < ALARM_BEEPS && !done; i++) {
            chat_ui_alarm_flash(true);           // red ring ON (LVGL paints it; panel stays lit)…
            vTaskDelay(pdMS_TO_TICKS(20));        // let the "on" frame land before the beep
            play_beep(s_alarm_pcm);              // ~90ms (blocks)
            chat_ui_alarm_flash(false);          // …ring hidden (dark) between
            vTaskDelay(pdMS_TO_TICKS(ALARM_GAP_MS));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        for (int t = 0; t < ALARM_PAUSE_MS && !done; t += 50) {   // dark pause, polling for the tap
            vTaskDelay(pdMS_TO_TICKS(50));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        cycle++;
    }
    chat_ui_alarm_set(false);                // remove overlay; resume saver; screen on
    bsp_display_brightness_set(ALARM_BRIGHT);
    char msg[72];
    snprintf(msg, sizeof msg, "Timer done%s%s", label[0] ? ": " : "", label);
    chat_ui_status(msg);
}

